Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་སེམས་ཅན་ཐམས་ཅད་ཚིམ་པར་བྱེད་པའི་ལུས་ཡོངས་སུ་སྟོན་པས། སྐལ་བ་མཉམ་པར་ལུས་ཀྱི་ལས་རྣམ་པར་དག་པ། ཆོས་ཀྱི་དབྱིངས་ཀྱི་ངེས་པའི་ཚིག་གི་ཐ་སྙད་ལ་སྐལ་བ་མཉམ་པར་དག་གི་ལས་རྣམ་པར་དག་པ། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་དུ་སྐལ་པ་མཉམ་པར་འདོད་པ། སངས་རྒྱས་ལ་མཆོད་ཅིང་རིམ་གྲོ་བྱ་བའི་ཕྱིར་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་སྐལ་བ་མཉམ་པར་རྒྱུ་བ། ཆོས་ཐམས་ཅད་ཀྱི་ཚུལ་ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་སྐལ་བ་མཉམ་པར་མངོན་སུམ་དུ་གྱུར་པའི་ཡེ་ཤེས་དང་ལྡན་པ།
en: The upāsikā Prabhūtā said, “Noble one, myself and these maidens and countless millions of others have the same conduct, the same prayer, the same roots of merit, the same display of setting forth, the same pure path of aspiration, the same pure mindfulness, the same pure mode of being, the same measureless realization, the same attainment of the highest faculties, the same pervasion of mind, the same range of the scope of conduct, the same way of the Dharma, the same ascertainment of meaning, the same teaching of the meaning of the Dharma, the same pure form, the same measureless strengths, the same voicing of the words of the Dharma, the same pure voice in all our communication, the same pure qualities in all our conduct because we are praised for limitless qualities, the same purity of karma because of having the pure ripening of faultless karma, the same all-pervasive great love because of our protection of all beings, the same pervasive great compassion because of our tireless ripening of all beings, the same pure karma of body because we manifest the bodies that satisfy beings according to their wishes, the same pure karma of speech in communicating the meaning of the words in the realm of the Dharma, the same arrival into the circles of the followers of all the buddhas, the same eagerness for all the buddha realms in order to serve and make offerings to all the buddhas, the same directly perceived knowledge in comprehending all the ways of the Dharma, and the same pure conduct in attaining all the bodhisattva levels.

source: བྱང་ཆུབ་སེམས་དཔའི་ས་ཐམས་ཅད་ཐོབ་པར་བྱ་བ་ལ་སྐལ་བ་མཉམ་པར་སྤྱོད་པ། རྣམ་པར་དག་པ་ཤ་སྟག་ཅིག་ཀྱང་ཡོད་དེ། རིགས་ཀྱི་བུ་བུད་མེད་སྟོང་ཕྲག་བཅུ་པོ་འདི་དག་ཀྱང་སྐད་ཅིག་གཅིག་ཏུ་འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་སྐུ་ཚེ་གཅིག་གིས་ཐོགས་པ་རྣམས་ལ་ཞལ་ཟས་ཡོངས་སུ་འབུལ་བའི་ཕྱིར་ཕྱོགས་བཅུར་རྒྱས་པར་འདོང་ངོ་། །
en: “Noble one, these ten thousand maidens, within one single instant, travel throughout the ten directions in order to offer food to the bodhisattvas in their final life.

source: ཕྲུ་བ་འདི་ཉིད་ནས་ཁ་ཟས་བླངས་ཤིང་། སྲིད་པའི་ཐ་མ་པ་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པ་རྣམས་ལ་བསོད་སྙོམས་འབུལ་བའི་ཕྱིར་ཕྱོགས་བཅུར་རྒྱས་པར་འདོང་ངོ་། །
en: They take food from this small pot and go throughout the ten directions in order to offer it as alms to śrāvakas and pratyeka­buddhas in their final life.

source: ཕྲུ་བ་འདི་ཉིད་ནས་ཁ་ཟས་བླངས་ཤིང་ཕྱོགས་བཅུ་རྒྱས་པར་བཀང་སྟེ་ཡི་དགས་ཀྱི་ཚོགས་ཐམས་ཅད་ཁ་ཟས་ཀྱིས་ཡོངས་སུ་ཚིམ་པར་བྱེད་དོ། །རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་མོ་ནི་ཕྲུ་བ་འདི་ཉིད་ནས་ལྷ་རྣམས་ནི་ལྷའི་ཁ་ཟས་ཀྱིས་ཡོངས་སུ་ཚིམ་པར་བྱེད་དོ། །
en: They take food from this small pot and go throughout the ten directions in order to satisfy all the hosts of pretas with the food.

source: ཀླུ་རྣམས་ནི་ཀླུའི་ཁ་ཟས་ཀྱིས། གནོད་སྦྱིན་རྣམས་ནི་གནོད་སྦྱིན་གྱི་ཁ་ཟས་ཀྱིས། དྲི་ཟ་རྣམས་ནི་དྲི་ཟའི་ཁ་ཟས་ཀྱིས། ལྷ་མ་ཡིན་རྣམས་ནི་ལྷ་མ་ཡིན་གྱི་ཁ་ཟས་ཀྱིས། ནམ་མཁའ་ལྡིང་རྣམས་ནི་ན་མ་མཁའ་ལྡིང་གི་ཁ་ཟས་ཀྱིས། མྱི་འམ་ཅི་རྣམས་ནི་མྱི་འམ་ཅིའི་ཁ་ཟས་ཀྱིས། ལྟོ་འཕྱེ་ཆེན་པོ་རྣམས་ནི་ལྟོ་འཕྱེ་ཆེན་པོའི་ཁ་ཟས་ཀྱིས། མྱི་རྣམས་ནི་མྱིའི་ཁ་ཟས་ཀྱིས། མྱི་མ་ཡིན་པ་རྣམས་ནི་མྱི་མ་ཡིན་པའི་ཁ་ཟས་ཀྱིས་ཡོངས་སུ་ཚིམ་པར་བྱེད་དོ། །
en: “Noble one, in that way I satisfy the devas with divine food from this small pot, and I satisfy nāgas with nāga food, yakṣas with yakṣa food, gandharvas with gandharva food, asuras with asura food, garuḍas with garuḍa food, kinnaras with kinnara food, mahoragas with mahoraga food, humans with human food, and nonhumans with nonhuman food.

source: རིགས་ཀྱི་བུ་ཡུད་ཙམ་ཞིག་སྡོད་དང་དེའུ་རེ་མངོན་དུ་འགྱུར་རོ། །དགེ་བསྙེན་མ་ཕུལ་དུ་བྱུང་བ་དེས་ཚིག་དེ་བརྗོད་མ་ཐག་ཏུ་དེའི་མོད་ལ་འདི་ལྟ་སྟེ།
en: “Noble one, stay a moment and you will see a sight.”

source: དགེ་བསྙེན་མ་ཕུལ་དུ་བྱུང་བས། སྔོན་གྱི་སྨོན་ལམ་གྱིས་བོས་པས་སེམས་ཅན་གྲངས་མྱེད་པ་ཞིག་ཤར་ཕྱོགས་ཀྱི་སྒོ་ནས་ནང་དུ་འོངས་པར་གྱུར་ཏོ། །དེ་བཞིན་དུ་འདི་ལྟ་སྟེ། དགེ་བསྙེན་མ་ཕུལ་དུ་བྱུང་བའི་སྔོན་གྱི་སྨོན་ལམ་གྱིས་བོས་པས། སེམས་ཅན་གྲངས་མྱེད་པ་ཞིག །
en: As soon as the upāsikā Prabhūtā said those words, at that moment, having been invited by the upāsikā Prabhūtā in the prayers she made in the past, countless beings came in through the eastern door.

source: ལྷོ་ཕྱོགས་དང་ནུབ་ཕྱོགས་དང་། བྱང་ཕྱོགས་ཀྱི་སྒོ་ནས་ནང་དུ་འོངས་པར་གྱུར་ཏེ། དེ་ལྟར་འོངས་པ་དེ་དག་དགེ་བསྙེན་མ་ཕུལ་དུ་བྱུང་བས། །སྟན་དེ་དག་ལ་བཀོད་དེ། སོ་སོ་ནས་ཅི་དགའ་བའི་ཁ་ཟས་ཚོད་མ་སྣ་ཚོགས་དང་། རོ་སྣ་ཚོགས་དང་། ཁ་དོག་སྣ་ཚོགས་དང་། དྲི་སྣ་ཚོགས་དང་ལྡན་པས་ཡོངས་སུ་ཚིམ་པར་བྱས་སོ། །ཡོངས་སུ་བསྟབས་པར་བྱས་སོ། །ཡོངས་སུ་དགའ་བ་བྱས་སོ། །ཡོངས་སུ་མགུ་བར་བྱས་སོ། །ཡོངས་སུ་སྤྲོ་བར་བྱས་སོ། །ཤིན་ཏུ་ཚིམ་པར་བྱས་སོ། །
en: In the same way, countless beings, invited by the upāsikā Prabhūtā in the prayers she made in the past, came in through the southern, the western, and the northern doors.

source: ཡིད་བདེ་བར་བྱས་སོ། །ཁ་ཟས་སྣ་ཚོགས་ཀྱིས་ཇི་ལྟ་བ་དེ་བཞིན་དུ་བཏུང་བ་རྣམ་པ་སྣ་ཚོགས་དང་། རོ་རྣམ་པ་སྣ་ཚོགས་དང་། སྟན་སྣ་ཚོགས་དང་། མལ་ཆ་སྣ་ཚོགས་དང་། བཞོན་བ་སྣ་ཚོགས་དང་།
en: Seated on her throne, the upāsikā Prabhūtā satisfied, made joyful, pleased, delighted, made content, and made happy those beings who had arrived with whatever foods they enjoyed, in various kinds of broths, with various flavors, various colors, and various aromas.

source: གོས་སྣ་ཚོགས་དང་། མེ་ཏོག་སྣ་ཚོགས་དང་། ཕྲེང་བ་སྣ་ཚོགས་དང་། སྤོས་སྣ་ཚོགས་དང་། བདུག་སྤོས་སྣ་ཚོགས་དང་། བྱུག་པ་སྣ་ཚོགས་དང་། ཕྱེ་མ་སྣ་ཚོགས་དང་། རིན་པོ་ཆེ་སྣ་ཚོགས་དང་། རྒྱན་སྣ་ཚོགས་དང་། རིན་པོ་ཆེའི་ཤིང་རྟ་སྣ་ཚོགས་དང་། གདུགས་སྣ་ཚོགས་དང་། རྒྱལ་མཚན་སྣ་ཚོགས་དང་། ལྷའི་བ་དན་སྣ་ཚོགས་དང་། ཡོ་བྱད་ཀྱི་ཡུལ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་ཚིམ་པར་བྱས་པ་ནས།
en: Just as with the food, she satisfied them and so on up to made them happy with various kinds of drinks, various kinds of flavors, various kinds of seats, various kinds of beds, various kinds of steeds, various kinds of clothing, various kinds of flowers, various kinds of garlands, various kinds of perfume, various kinds of incense, various kinds of ointments, various kinds of powders, various kinds of jewels, various kinds of jewelry, various kinds of precious carriages, various kinds of parasols, various kinds of banners, various kinds of flags, and various kinds from among the entire range of utensils.

source: ཡིད་དགའ་བར་འགྱུར་བའི་བར་དུ་བྱས་སོ། །ལྷ་རྣམས་ནི་ལྷའི་ཁ་ཟས་ཀྱིས་ཡོངས་སུ་ཚིམ་པར་བྱས་སོ། །ཀླུ་དང་གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་ལྷ་མ་ཡིན་དང་། ནམ་མཁའི་ལྡིང་དང་། མྱིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མྱི་དང་མྱི་མ་ཡིན་པ་རྣམས་ཀྱང་མྱི་མ་ཡིན་པའི་ཁ་ཟས་ཀྱིས་ཡོངས་སུ་ཚིམ་པར་བྱས་པ་ནས། ཡིད་བདེ་བར་འགྱུར་བའི་བར་དུ་བྱས་སོ། །
en: She satisfied and so on up to made happy devas with divine food, and she and satisfied nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, humans, and nonhumans with their food.

source: འོན་ཀྱང་ཕྲུ་བ་དེ་ལས་འགོང་བར་གྱུར་བ་མྱེད། འགྲིབ་པ་མྱེད། དམས་པ་མྱེད། ཟད་པར་གྱུར་པ་མྱེད། ས་མཚམས་སུ་གྱུར་པ་མྱེད།
en: Nevertheless, her small pot was never diminished, depleted, emptied, used up, exhausted, spent, or finished, and it never came to an end.

source: མཐར་ཐུག་པ་མྱེད། མུར་ཐུག་པ་མྱེད་དོ། །དེ་ནས་དགེ་བསྙེན་མ་ཕུལ་དུ་བྱུང་བ་དེས། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁོ་མོས་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་བསོད་ནམས་ཀྱི་མཛོད་མི་ཟད་པའི་རྒྱན་ཅེས་བྱ་བ་འདི་ཤེས་པར་ཟད་ན། བྱང་ཆུབ་སེམས་དཔའི་བསོད་ནམས་ཆེན་པོའི་རྒྱ་མཚོ་མི་ཟད་པས། མྱི་ཟད་པའི་བསོད་ནམས་དང་ལྡན་པ་བསོད་ནམས་ཀྱི་ཚོགས་རྒྱ་ཆེན་པོ་ཤིན་ཏུ་བསྩགས་པས། ནམ་མཁའ་ལྟ་བུར་གྱུར་པ། འགྲོ་བ་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པས། ནོར་བུ་རིན་པོ་ཆེ་ཡིད་བཞིན་གྱི་རྒྱལ་པོ་ལྟ་བུ། འགྲོ་བ་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་ཡོངས་སུ་བསྲུང་བས།
en: Then the upāsikā Prabhūtā said to Sudhana, the head merchant’s son, “I know only this bodhisattva liberation called the unceasing display of the treasure of merit.

source: བསོད་ནམས་ཆེན་པོའི་འཁོར་ཡུག་དང་ལྡན་པ། འགྲོ་བ་ཐམས་ཅད་དུ་རིན་པོ་ཆེ་སྙིམ་པ་ནས་ཆར་ལྟར་འཐོར་བས་བསོད་ནམས་ཆེན་པོའི་སྤྲིན་དུ་གྱུར་བ། ཆོས་ཀྱི་གྲོང་ཁྱེར་གྱི་སྒོ་འབྱེད་པས། བསོད་ནམས་ཆེན་པོའི་མཛོད་ལ་མངོན་སུམ་དུ་ལྟ་བ། འགྲོ་བ་ཐམས་ཅད་ཀྱི་ཕོངས་པའི་མུན་པ་སེལ་བས་བསོད་ནམས་ཆེན་པོའི་སྒྲོན་མར་གྱུར་པ།
en: How could I know or describe the qualities of the conduct of bodhisattvas who have an inexhaustible ocean of merit, who possess inexhaustible merit, who have accumulated a vast accumulation of merit and are therefore like space, who fulfill the prayers of all beings and are therefore like the king of wish-fulfilling jewels, who protect the roots of merit of all beings and are therefore like a Cakravāla mountain range of merit, who send down a rain of jewels from their hands and are therefore like a great cloud of merit, who open the gate to the city of the Dharma and are therefore like the direct vision of a treasure of great merit, and who dispel the darkness of the poverty of all beings and are therefore like a lamp of great merit?

source: དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ། །
en: “Depart, noble one.

source: ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན། སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན་གྲོང་ཁྱེར་འབྱུང་བ་ཆེན་པོ་ཞེས་བྱ་བ་ཡོད་དེ།
en: In this southern region there is a town called Mahāsaṃbhava.

source: དེ་ན་ཁྱིམ་བདག་མཁས་པ་ཞེས་བྱ་བ་འདུག་གིས།
en: There dwells a householder by the name of Vidvān.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགེ་བསྙེན་མ་ཕུལ་དུ་བྱུང་བའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། དགེ་བསྙེན་མ་ཕུལ་དུ་བྱུང་བ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། ཡང་དང་ཡང་བལྟས་ཏེ། དགེ་བསྙེན་མ་ཕུལ་དུ་བྱུང་བའི་དྲུང་ནས་བལྟ་བས་མི་ངོམས་བཞིན་དུ་སོང་ངོ་། །
en: Sudhana bowed his head to the feet of the upāsikā Prabhūtā, circumambulated the upāsikā Prabhūtā, keeping her to his right, many hundreds of thousands of times, and, looking back again and again, departed from the upāsikā Prabhūtā.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་བསོད་ནམས་ཀྱི་མཛོད་མྱི་ཟད་པའི་རྒྱན་གྱི་རྣམ་པར་ཐར་པའི་སྣང་བ་རབ་ཏུ་ཐོབ་པ་དེ།
en: Vidvān Chapter 17 Sudhana, the head merchant’s son, had obtained the light of the liberation called the unceasing display of the treasure of merit.

source: བསོད་ནམས་རྒྱ་མཚོ་དེ་ལ་ནི་རྗེས་སུ་སེམས།
en: He contemplated that ocean of merit.

source: བསོད་ནམས་ནམ་མཁའ་དེ་ལ་ནི་ཀུན་ཏུ་བལྟ།
en: He viewed that sky of merit.

source: བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་ནི་ཡོངས་སུ་འཛིན།
en: He obtained that heap of merit.

source: བསོད་ནམས་ཀྱི་རི་བོ་དེ་ལ་ནི་མངོན་པར་འཛེག །
en: He climbed that mountain of merit.

source: བསོད་ནམས་ཀྱི་ཚོགས་དེ་ནི་ཡང་དག་པར་སྡུད།
en: He accumulated that store of merit.

source: བསོད་ནམས་ཀྱི་ཆུ་བོ་དེ་ལ་ནི་ཡོངས་སུ་འབོག །
en: He immersed himself in that river of merit.

source: བསོད་ནམས་ཀྱི་མུ་སྟེགས་དེ་ལས་ནི་རབ་ཏུ་འབབ།
en: He descended the steps into the bathing place of that merit.

source: བསོད་ནམས་ཀྱི་དཀྱིལ་འཁོར་དེ་ནི་ཡོངས་སུ་སྦྱོང་།
en: He purified that field of merit.

source: བསོད་ནམས་ཀྱི་གཏེར་དེ་ལ་ནི་ཡང་དག་པར་བལྟ།
en: He looked at that treasure of merit.

source: བསོད་ནམས་ཀྱི་ཚུལ་དེ་ནི་རྗེས་སུ་དྲན་པར་བྱེད།
en: He thought of that way of merit.

source: བསོད་ནམས་ཀྱི་ཆོས་དེ་ནི་ཡོངས་སུ་འཛིན།
en: He paid attention to that tradition of merit.

source: བསོད་ནམས་ཀྱི་རྒྱུད་དེ་ནི་ཡོངས་སུ་སྦྱོང་བ་བྱེད་ཅིང་།
en: He purified that lineage of merit.

source: མཐར་གྱིས་གྲོང་ཁྱེར་འབྱུང་བ་ཆེན་པོ་གང་ན་བ་དེར་ཕྱིན་ནས། དགེ་བའི་བཤེས་གཉེན་འདོད་ཅིང་དགེ་བའི་བཤེས་གཉེན་ལྟ་བས་བསྒོས་པའི་སེམས་ཀྱི་རྒྱུད་དང་། དགེ་བའི་བཤེས་གཉེན་གྱི་བྱིན་གྱིས་བརླབས་པའི་བསམ་པ་དང་། དགེ་བའི་བཤེས་གཉེན་ལ་ཐོགས་པ་མེད་པའི་སྦྱོར་བ་དང་། དགེ་བའི་བཤེས་གཉེན་ལ་རིམ་གྲོ་བྱ་བས་སྐྱོ་བ་མེད་པའི་བརྩོན་འགྲུས་དང་།
en: Eventually he arrived at the town called Mahāsaṃbhava and searched, sought, and looked around for the householder Vidvān.

source: དགེ་བའི་བཤེས་གཉེན་ལ་རག་ལུས་པའི་དགེ་བའི་རྩ་བ་ཐམས་ཅད་དང་། དགེ་བའི་བཤེས་གཉེན་གྱིས་ངེས་པར་གྱུར་པའི་བསོད་ནམས་ཀྱི་ཚོགས་ཐམས་ཅད་དང་། དགེ་བའི་བཤེས་གཉེན་གྱིས་རྣམ་པར་སྤེལ་བའི་ཐབས་མཁས་པའི་སྤྱོད་པ་དང་། གཞན་གྱི་དྲིང་མི་འཇོག་པར་དགེ་བའི་བཤེས་གཉེན་ལ་རིམ་གྲོ་བྱ་བ་ལ་མཁས་པ་དང་། རྣམ་པར་འཕེལ་བའི་དགེ་བའི་རྩ་བ་ཐམས་ཅད་དང་། རྣམ་པར་དག་པར་འགྱུར་བའི་བྱང་ཆུབ་སེམས་དཔའི་ལྷག་པའི་བསམ་པ་དང་། ཡང་དག་པར་འཕེལ་བའི་བྱང་ཆུབ་སེམས་དཔའི་དབང་པོ་དང་། ཡོངས་སུ་སྨིན་པར་འགྱུར་བའི་དགེ་བའི་རྩ་བ་ཐམས་ཅད་དང་། ཡང་དག་པར་འཕེལ་བའི་སྨོན་ལམ་ཆེན་པོ་མངོན་པར་བསྒྲུབ་པ་དང་།
en: He searched for the householder Vidvān while longing for kalyāṇamitras, with his being transformed by seeing kalyāṇamitras, with an aspiration that was the blessing of the kalyāṇamitras, with dedication to following kalyāṇamitras, with diligence in tireless service of the kalyāṇamitras, with all the roots of merit of relying on kalyāṇamitras, with all the accumulation of merit through being faithful to the kalyāṇamitras, with the practice of the skillful methods increased by the kalyāṇamitras, with skill in serving the kalyāṇamitras without relying on anyone else, and while increasing all his roots of merit, purifying the bodhisattva motivation, increasing the bodhisattva faculties, ripening all roots of merit, increasing the fulfillment of great prayers, making great compassion vast, seeing himself as coming close to omniscience, receiving the Dharma radiance of the completely good bodhisattva conduct from all the buddhas, and increasing the illumination of the ten strengths of the tathāgatas.

source: ཤིན་ཏུ་ཡངས་པར་འགྱུར་བའི་སྙིང་རྗེ་ཆེན་པོས་བདག་ཉིད་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཉེ་བར་གྱུར་པར་ཡང་དག་པར་མཐོང་ནས།
en: He saw the householder Vidvān at the crossroads in the center of the town.

source: སངས་རྒྱས་ཐམས་ཅད་ལས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པས་ཆོས་ཀྱི་སྣང་བ་ཡང་དག་པར་བླང་བ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་སྣང་བ་རྣམ་པར་འཕེལ་བར་བྱེད་ཅིང་ཁྱིམ་བདག་མཁས་པ་ཡོངས་སུ་ཚོལ་ཚོལ་བ་ལས།
en: He was upon a dais made of the seven precious materials.

source: གྲོང་ཁྱེར་གྱི་དབུས་ལམ་གྱི་བཞི་མདོ་ཞིག་ན་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་སྟེགས་བུ་ཞིག་ལ།
en: He was seated upon an excellent throne made of countless jewels.

source: རིན་པོ་ཆེ་གྲངས་མེད་པ་ལས་བྱས་པའི་ཁྲི་ནོར་བུ་རིན་པོ་ཆེའི་རྐང་པ་རྡོ་རྗེ་དང་། ཨིན་དྲ་ནཱི་ལ་སྣ་ཚོགས་ཀྱིས་སྤྲས་པ་བཀྱེ་བ།
en: Its legs of precious jewels were adorned with various diamonds and sapphires.

source: གསེར་གྱི་ལྕག་ཕོད་ཀྱི་དྲ་བས་ལེགས་པར་བླས་པ།
en: It was covered with a network of strings of gold.

source: ནོར་བུ་རིན་པོ་ཆེ་དྲི་མ་མེད་པའི་སྙིང་པོ་ཅན་རིན་པོ་ཆེ་ལྔ་བརྒྱ་ཙམ་གྱིས་གཟུགས་ལེགས་པར་བརྒྱན་པ།
en: It contained stainless precious jewels. Its form was decorated with five hundred jewels.

source: ལྷ་རྫས་ཀྱི་སྟན་སྣ་ཚོགས་བཏིང་བ།
en: Various cushions of divine material were set upon it.

source: གམ་ཡོ་ནས་ལྷ་རྫས་ཀྱི་གོས་ཀྱི་རྒྱལ་མཚན་དང་།
en: Around it stood streamers, banners, and flags made of divine cloth.

source: བ་དན་མང་པོ་བསྒྲེང་བ། རིན་པོ་ཆེ་དུ་མའི་དྲ་བས་ཀུན་ནས་ཡོག་པ་རིན་པོ་ཆེའི་བླ་རེ་ཆེན་པོ་བྲེས་པ།
en: It was covered by a net of strings of many jewels.

source: བླ་ནས་གསེར་དང་རིན་པོ་ཆེའི་མེ་ཏོག་གི་ལྡ་ལྡི་མང་པོ་བཀྱེ་བ་ཞིག་ལ་འདུག་ཅིང་།
en: Overhead was a great bejeweled canopy, from which hung wreaths of flowers of gold and jewels.

source: འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་གྱི་གདུགས་ཡུ་བ་དྲི་མ་མེད་པ་བཻཌཱུརྱ་ལས་བྱས་པ་ནི་དྲུང་ན་བསྒྲེང་ཞིང་བཟུང་།
en: A parasol of Jambu River gold was held aloft by its stainless handle made of beryl.

source: རིན་པོ་ཆེའི་གཡག་རྔ་དྲི་མ་མེད་པའི་རྡུལ་ཡབ་ངང་པའི་རྒྱལ་པོ་ལྟ་བུས་ནི་ལེགས་པར་གཡབ་སྤོས་ཀྱི་རིམ་གྲོའི་ཡོ་བྱད་སྣ་ཚོགས་ཀྱིས་ནི་བདུགས་ཤིང་བསངས། རོལ་མོ་བརྡུང་བ་དང་།
en: Vidvān was being fanned by precious stainless fans made of the feathers of the king of geese, and censers of various incenses perfumed the air around him.

source: དཀྲོལ་བ་ལྷ་རྫས་ཀྱི་དབྱངས་ལས་འདས་པར་སྒྲ་འབྱིན་པ་ལྔ་བརྒྱ་ཙམ་ནི་གཡས་གཡོན་ནས་བརྡུངས་ཤིང་དཀྲོལ། གྲོང་ཁྱེར་འབྱུང་བ་ཆེན་པོ་ན་འཁོད་པའི་སེམས་ཅན་རྣམས་ཤིན་ཏུ་དགའ་བར་བྱ་བའི་དོན་དུ་ལྷ་རྫས་ཀྱི་མྱེ་ཏོག་གི་སྤྲིན་གྱི་ཆར་ནི་ཀུན་ནས་འབབ་པར་གྱུར།
en: There was an entourage of five thousand musicians to the right and left who played and beat on musical instruments, emitting a beautiful music that transcended that of the devas and filled the town of Mahāsaṃbhava in order to bring delight to beings.

source: གཡོག་སྲོག་ཆགས་སྟོང་ཕྲག་བཅུ་ཙམ་སྔོན་དགེ་བའི་རྩ་བ་སྐལ་བ་མཉམ་པར་སྤྱོད་སྤྱོད་པ་དག་ཉན་ཅིང་ཅི་དགའ་བར་བྱེད་པ།
en: These ten thousand beings let fall a rain from clouds of divine flowers.

source: ལྷ་རྫས་ལས་འདས་པའི་རྒྱན་གྱིས་ཤིན་ཏུ་བརྒྱན་པ།
en: Their bodies surpassed those of devas and humans.

source: བྱང་ཆུབ་སེམས་དཔའི་བསམ་པ་ཡོངས་སུ་གྲུབ་པ། ལྷ་དང་མིའི་གཟུགས་ལས་ཤིན་ཏུ་འདས་པ་ཤ་སྟག་གིས་ཀུན་ནས་བསྐོར་ཅིང་འདུག་པ་མཐོང་ནས།
en: They had the complete bodhisattva motivation and were adorned with jewelry that surpassed that of the devas.

source: ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཁྱིམ་བདག་མཁས་པ་གང་ན་བ་དེར་སོང་སྟེ། ཕྱིན་ནས་ཁྱིམ་བདག་མཁས་པའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། ཁྱིམ་བདག་མཁས་པ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་མདུན་དུ་འདུག་སྟེ། ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། འཕགས་པ་བདག་ནི་འདི་ལྟ་སྟེ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་ཞི་བར་བགྱི་བ་དང་།
en: Sudhana, the head merchant’s son, approached the householder Vidvān and, having come up to him, bowed his head to Vidvān’s feet, circumambulated him, keeping him to his right, many hundreds of thousands of times, and sat down before him.

source: སེམས་ཅན་ཐམས་ཅད་ཤིན་ཏུ་བདེ་བ་ལ་དགོད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་འཁོར་བའི་རྒྱ་མཚོ་ནས་མངོན་པར་གདོན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཆོས་རིན་པོ་ཆེའི་གླིང་དུ་ཡང་དག་པར་བསྐྱལ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྲེད་པའི་བརླན་ཤིན་ཏུ་བསྐམ་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྙིང་རྗེའི་བརླན་ཡང་དག་པར་བསྐྱེད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་འདོད་པའི་དགའ་བ་དང་། སྲེད་པ་རྣམ་པར་བཟློག་པ་དང་། སེམས་ཅན་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ལ་མོས་ཤིང་བསྒྲུབ་པར་བགྱི་བ་དང་། སེམས་ཅན་ཐམས་ཅད་འཁོར་བའི་དགོན་པ་ལས་ཡང་དག་པར་བཟླ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་དང་ཆོས་ལ་དགའ་ཞིང་མོས་པ་ཡང་དག་པར་བསྐྱེད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཁམས་གསུམ་གྱི་གྲོང་རྡལ་ནས་གདོན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཐམས་ཅད་མཁྱེན་པའི་ཕོ་བྲང་དུ་གཟུད་པར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་བླ་ན་མྱེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཞུགས་ཀྱིས་ཀྱང་།
en: With his palms together in homage, Sudhana said, “Ārya, I have set out to attain the highest, complete enlightenment in order to end the suffering of all beings, in order to bring all beings to happiness, in order to save all beings from the ocean of saṃsāra, in order to take all beings across to the island of the jewels of the Dharma, in order to dry up the moisture of the cravings of all beings, in order to create the moisture of compassion in all beings, in order to expel all delight and craving of desire from all beings, in order to make all beings gain a craving for the wisdom of buddhahood, in order to make all beings pass through the jungle of saṃsāra, in order to make all beings develop a delight and desire for the Dharma and the qualities of the buddhas, in order to make all beings depart from the city of the three realms, and in order to lead all beings to the city of omniscience.

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་མ་འཚལ་ཏེ།
en: “However, I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: འཕགས་པ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་བསླབ་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་རྟེན་དུ་འགྱུར་བ་བདག་ལ་བཤད་དུ་གསོལ། དེ་སྐད་ཅེས་སྨྲས་པ་དང་།
en: I pray that you explain to me how bodhisattvas should train in bodhisattva conduct and how having trained in it they become supports for all beings!”

source: ཁྱིམ་བདག་མཁས་པས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་དེ་ལྟར་ཁྱོད་ཀྱིས་བླ་ན་མྱེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ལེགས་སོ་ལེགས་སོ། །རིགས་ཀྱི་བུ་སེམས་ཅན་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ཅིང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་ཚོལ་བ་དང་། དགེ་བའི་བཤེས་གཉེན་བལྟ་བས་མྱི་ངོམས་པ་དང་།
en: The householder Vidvān said to Sudhana, the head merchant’s son, “Noble one, it is excellent, excellent, that you have developed the aspiration for the highest, complete enlightenment!

source: དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བས་མྱི་སྐྱོ་བ་དང་། དགེ་བའི་བཤེས་གཉེན་ལ་རིམ་གྲོ་བྱ་བས་སྒྱིད་ལུག་པ་མེད་པ་དང་། དགེ་བའི་བཤེས་གཉེན་བཙལ་བས་ཡིད་མྱི་བདེ་བ་མྱི་སྐྱེད་པ་དང་། དགེ་བའི་བཤེས་གཉེན་བཙལ་བ་ལས་ཕྱིར་མྱི་ལྡོག་པ་དང་། དགེ་བའི་བཤེས་གཉེན་ལ་མོས་ཤིང་དང་བའི་ཡིད་ལས་རྣམ་པར་མྱི་ལྡོག་པ་དང་།
en: “Noble one, it is rare to find a being who develops the aspiration for the highest, complete enlightenment, who seeks the bodhisattva conduct, who never has enough of gazing upon a kalyāṇamitra, who never tires of coming into the presence of a kalyāṇamitra, who never becomes dispirited in serving a kalyāṇamitra, who never becomes unhappy with seeking a kalyāṇamitra, who never turns back from seeking a kalyāṇamitra, who never ceases to sincerely yearn for and be attracted to a kalyāṇamitra, who never turns away from gazing upon a kalyāṇamitra, who is never despondent in following the instructions of a kalyāṇamitra, and who never wearies of serving and honoring a kalyāṇamitra.

source: དགེ་བའི་བཤེས་གཉེན་གྱི་ངོར་བལྟ་བ་ལས་ཕྱིར་མྱི་ལྡོག་པ་དང་། དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་གི་ཚུལ་ལ་ཞུམ་པ་མྱེད་པ་དང་། དགེ་བའི་བཤེས་གཉེན་ལ་རིམ་གྲོ་དང་བསྙེན་བཀུར་བྱ་བས་མྱི་སྐྱོ་བ་དེ་ལྟ་བུ་ནི་ཤིན་ཏུ་དཀོན་ནོ། །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཁོ་བོའི་འཁོར་འདི་དག་མཐོང་ངམ།
en: “Noble one, do you see those in my entourage?”

source: སྨྲས་པ་འཕགས་པ་མཐོང་ངོ་།
en: Sudhana replied, “Yes, Ārya, I see them.”

source: སྨྲས་པ་རིགས་ཀྱི་བུ་འདི་དག་ཀུན་ཀྱང་ཁོ་བོས་བླ་ན་མྱེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དག་སྟེ།
en: Vidvān said, “Noble one, I made all of them develop the aspiration for the highest, complete enlightenment.

source: འདི་དག་ནི་ཁོ་བོས་དེ་བཞིན་གཤེགས་པའི་རིགས་སུ་བསྐྱེད་པའོ། །
en: I have caused them to be reborn in the family of the tathāgatas.

source: འདི་དག་ནི་ཁོ་བོས་ཕ་རོལ་ཏུ་ཕྱིན་པས་བསྡུས་ཏེ་གསོལ་པའོ། །
en: I have nourished them through the accumulation of the perfections.

source: འདི་དག་ནི་ཁོ་བོས་ཆོས་དཀར་པོ་ཐམས་ཅད་ཀྱིས་བསྐྱེད་པའོ། །
en: I have made them practice all the good qualities.

source: འདི་དག་ནི་ཁོ་བོས་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ལ་རྣམ་པར་བསྐྱེད་པའོ། །
en: I have made them develop the ten strengths of the tathāgatas.

source: འདི་དག་ནི་ཁོ་བོས་འཇིག་རྟེན་གྱི་རིགས་ལས་གྱེན་དུ་བསྐྱོད་པའོ། །
en: I have made them transcend the family of the world.

source: འདི་དག་ནི་ཁོ་བོས་དེ་བཞིན་གཤེགས་པའི་རིགས་ལ་བཀོད་པའོ། །
en: I have established them in the family of the tathāgatas.

source: འདི་དག་ནི་ཁོ་བོས་འཇིག་རྟེན་གྱི་ལམ་གྱི་འཁོར་ལོ་ལས་བཟློག་པའོ།
en: I have made them turn away from the wheel of worldly existences.

source: འདི་དག་ནི་ཁོ་བོས་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་ལ་བཙུད་པའོ། །
en: I have made them enter into the turning of the wheel of the Dharma.

source: འདི་དག་ནི་ཁོ་བོས་ངན་སོང་གསུམ་གྱི་རྒྱུད་དུ་ལྟུང་བ་ལས་ཡོངས་སུ་བཟུང་བའོ། །
en: I have saved them from falling into lives in the three lower existences.

source: འདི་དག་ནི་ཁོ་བོས་ཆོས་ཉིད་ཁོང་ད་ཆུད་པར་བྱ་བ་ལ་བཀོད་པ་སྟེ།
en: I have established them in the understanding of the true nature of phenomena.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྐྱབས་སུ་གྱུར་པ་ཡིན་ནོ། །
en: “Noble one, it is in that way that bodhisattvas become a refuge for all beings.

source: རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་ཡིད་ཀྱི་མཛོད་ནས་བྱུང་བའི་བསོད་ནམས་མང་པོ་ཐོབ་པ་སྟེ། དེའི་མཐུས་ཁོ་བོ་ནི་ཟས་འདོད་པ་རྣམས་ལ་ཁ་ཟས་ཀྱི་སྦྱིན་པ་བྱེད་དོ། །བཏང་བ་འདོད་པ་རྣམས་ལ་བཏུང་བ་དང་། རོའི་དམ་པ་འདོད་པ་རྣམས་ལ་རོའི་དམ་པ་དང་། བཟའ་བ་འདོད་པ་རྣམས་ལ་བཟའ་བ་དང་། བཅའ་བ་འདོད་པ་རྣམས་ལ་བཅའ་བ་དང་། བལྡག་པ་འདོད་པ་རྣམས་ལ་བལྡག་པ་དང་། མུར་པ་འདོད་པ་རྣམས་ལ་མུར་པ་དང་།
en: “Noble one, I have attained the bodhisattva liberation calledthe merit that arises from the treasury of mind.
